server/performance/tests/appointments.lab.yml
# ==============================================================================
# tests/appointments.lab.yml — Performance tests for Lab Booking routes
# Route file : server/src/routes/appointmentRoutes.js
# Base URL   : http://localhost:8081
# NOTE: These routes are mounted at the ROOT (app.use(labAppointmentRoutes))
#       so the full path includes /api/ as part of the route definition itself.
# Endpoints tested:
#   POST /api/bookappointment              → Book a lab appointment
#   GET  /api/getallappointments           → Admin: list all lab appointments
#   GET  /api/user-appointments/:userId    → User: list own lab appointments
#   GET  /api/getappointments/:centerId    → Center: list center appointments
# ==============================================================================
#
# Run this test:
#   npx artillery run server/performance/tests/appointments.lab.yml
# ==============================================================================

config:
  target: "http://localhost:5000"

  defaults:
    headers:
      Content-Type: "application/json"
      Accept: "application/json"

  variables:
    # Replace with real IDs from your seeded DB
    userId: "REPLACE_WITH_REAL_USER_ID"
    centerId: "REPLACE_WITH_REAL_CENTER_ID"
    bookingId: "REPLACE_WITH_REAL_BOOKING_ID"

  phases:
    - name: "Warm-up"
      duration: 15
      arrivalRate: 3

    - name: "Ramp-up"
      duration: 30
      arrivalRate: 3
      rampTo: 20

    - name: "Sustained load"
      duration: 60
      arrivalRate: 20

  plugins:
    metrics-by-endpoint: {}

scenarios:
  # ============================================================================
  # SCENARIO 1 — Book a lab appointment
  # Tests POST /api/bookappointment under concurrent load.
  # Fill in the json body to match what your bookAppointment controller expects.
  # ============================================================================
  - name: "Book a lab appointment"
    weight: 2
    flow:
      - post:
          url: "/api/bookappointment"
          json:
            userId: "{{ userId }}"
            centerId: "{{ centerId }}"
            # Add testTypeId, date, time, or whatever fields your controller requires
            appointmentDate: "2026-04-10"
            timeSlot: "09:00"
          expect:
            - statusCode:
                - 200
                - 201

  # ============================================================================
  # SCENARIO 2 — Admin: get all lab appointments
  # High-cost DB scan — measures how it holds up under concurrent requests.
  # ============================================================================
  - name: "Admin — get all lab appointments"
    weight: 1
    flow:
      # GET /api/getallappointments
      # This may require an admin JWT — add Authorization header if protected.
      - get:
          url: "/api/getallappointments"
          expect:
            - statusCode: 200

  # ============================================================================
  # SCENARIO 3 — User: list their own lab appointments
  # Most frequent read pattern: patient checking their bookings.
  # ============================================================================
  - name: "User — list own lab appointments"
    weight: 5
    flow:
      # GET /api/user-appointments/:userId
      - get:
          url: "/api/user-appointments/{{ userId }}"
          expect:
            - statusCode: 200

  # ============================================================================
  # SCENARIO 4 — Center: list appointments for a specific center
  # ============================================================================
  - name: "Center — list center appointments"
    weight: 2
    flow:
      # GET /api/getappointments/:centerId
      - get:
          url: "/api/getappointments/{{ centerId }}"
          expect:
            - statusCode: 200